Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/nvm.h
/* -------- NVM_NVMPWPGTE : (NVM Offset: 0xE0) (R/W 32)  -------- */
#define NVM_NVMPWPGTE_RESETVALUE              _UINT32_(0x80FFFFFF)                                 /*  (NVM_NVMPWPGTE)   Reset Value */

#define NVM_NVMPWPGTE_PWPGTE_Pos              _UINT32_(0)                                          /* (NVM_NVMPWPGTE)  Position */
#define NVM_NVMPWPGTE_PWPGTE_Msk              (_UINT32_(0xFFFFFF) << NVM_NVMPWPGTE_PWPGTE_Pos)     /* (NVM_NVMPWPGTE)  Mask */
#define NVM_NVMPWPGTE_PWPGTE(value)           (NVM_NVMPWPGTE_PWPGTE_Msk & (_UINT32_(value) << NVM_NVMPWPGTE_PWPGTE_Pos)) /* Assigment of value for PWPGTE in the NVM_NVMPWPGTE register */
#define NVM_NVMPWPGTE_ULOCK_Pos               _UINT32_(31)                                         /* (NVM_NVMPWPGTE)  Position */
#define NVM_NVMPWPGTE_ULOCK_Msk               (_UINT32_(0x1) << NVM_NVMPWPGTE_ULOCK_Pos)           /* (NVM_NVMPWPGTE)  Mask */
#define NVM_NVMPWPGTE_ULOCK(value)            (NVM_NVMPWPGTE_ULOCK_Msk & (_UINT32_(value) << NVM_NVMPWPGTE_ULOCK_Pos)) /* Assigment of value for ULOCK in the NVM_NVMPWPGTE register */
#define NVM_NVMPWPGTE_Msk                     _UINT32_(0x80FFFFFF)                                 /* (NVM_NVMPWPGTE) Register Mask  */


/* -------- NVM_NVMPWPGTECLR : (NVM Offset: 0xE4) (R/W 32)  -------- */
#define NVM_NVMPWPGTECLR_RESETVALUE           _UINT32_(0x00)                                       /*  (NVM_NVMPWPGTECLR)   Reset Value */

#define NVM_NVMPWPGTECLR_Msk                  _UINT32_(0x00000000)                                 /* (NVM_NVMPWPGTECLR) Register Mask  */


/* -------- NVM_NVMPWPGTESET : (NVM Offset: 0xE8) (R/W 32)  -------- */
#define NVM_NVMPWPGTESET_RESETVALUE           _UINT32_(0x00)                                       /*  (NVM_NVMPWPGTESET)   Reset Value */

#define NVM_NVMPWPGTESET_Msk                  _UINT32_(0x00000000)                                 /* (NVM_NVMPWPGTESET) Register Mask  */


/* -------- NVM_NVMPWPGTEINV : (NVM Offset: 0xEC) (R/W 32)  -------- */
#define NVM_NVMPWPGTEINV_RESETVALUE           _UINT32_(0x00)                                       /*  (NVM_NVMPWPGTEINV)   Reset Value */

#define NVM_NVMPWPGTEINV_Msk                  _UINT32_(0x00000000)                                 /* (NVM_NVMPWPGTEINV) Register Mask  */


/* -------- NVM_NVMLBWP : (NVM Offset: 0xF0) (R/W 32)  -------- */
#define NVM_NVMLBWP_RESETVALUE                _UINT32_(0x80FFFFFF)                                 /*  (NVM_NVMLBWP)   Reset Value */

#define NVM_NVMLBWP_LBWP0_Pos                 _UINT32_(0)                                          /* (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP0_Msk                 (_UINT32_(0x1) << NVM_NVMLBWP_LBWP0_Pos)             /* (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP0(value)              (NVM_NVMLBWP_LBWP0_Msk & (_UINT32_(value) << NVM_NVMLBWP_LBWP0_Pos)) /* Assigment of value for LBWP0 in the NVM_NVMLBWP register */
#define NVM_NVMLBWP_LBWP1_Pos                 _UINT32_(1)                                          /* (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP1_Msk                 (_UINT32_(0x1) << NVM_NVMLBWP_LBWP1_Pos)             /* (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP1(value)              (NVM_NVMLBWP_LBWP1_Msk & (_UINT32_(value) << NVM_NVMLBWP_LBWP1_Pos)) /* Assigment of value for LBWP1 in the NVM_NVMLBWP register */
#define NVM_NVMLBWP_LBWP2_Pos                 _UINT32_(2)                                          /* (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP2_Msk                 (_UINT32_(0x1) << NVM_NVMLBWP_LBWP2_Pos)             /* (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP2(value)              (NVM_NVMLBWP_LBWP2_Msk & (_UINT32_(value) << NVM_NVMLBWP_LBWP2_Pos)) /* Assigment of value for LBWP2 in the NVM_NVMLBWP register */
#define NVM_NVMLBWP_LBWP3_Pos                 _UINT32_(3)                                          /* (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP3_Msk                 (_UINT32_(0x1) << NVM_NVMLBWP_LBWP3_Pos)             /* (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP3(value)              (NVM_NVMLBWP_LBWP3_Msk & (_UINT32_(value) << NVM_NVMLBWP_LBWP3_Pos)) /* Assigment of value for LBWP3 in the NVM_NVMLBWP register */
#define NVM_NVMLBWP_LBWP4_Pos                 _UINT32_(4)                                          /* (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP4_Msk                 (_UINT32_(0x1) << NVM_NVMLBWP_LBWP4_Pos)             /* (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP4(value)              (NVM_NVMLBWP_LBWP4_Msk & (_UINT32_(value) << NVM_NVMLBWP_LBWP4_Pos)) /* Assigment of value for LBWP4 in the NVM_NVMLBWP register */
#define NVM_NVMLBWP_LBWP5_Pos                 _UINT32_(5)                                          /* (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP5_Msk                 (_UINT32_(0x1) << NVM_NVMLBWP_LBWP5_Pos)             /* (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP5(value)              (NVM_NVMLBWP_LBWP5_Msk & (_UINT32_(value) << NVM_NVMLBWP_LBWP5_Pos)) /* Assigment of value for LBWP5 in the NVM_NVMLBWP register */
#define NVM_NVMLBWP_LBWP6_Pos                 _UINT32_(6)                                          /* (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP6_Msk                 (_UINT32_(0x1) << NVM_NVMLBWP_LBWP6_Pos)             /* (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP6(value)              (NVM_NVMLBWP_LBWP6_Msk & (_UINT32_(value) << NVM_NVMLBWP_LBWP6_Pos)) /* Assigment of value for LBWP6 in the NVM_NVMLBWP register */
#define NVM_NVMLBWP_LBWP7_Pos                 _UINT32_(7)                                          /* (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP7_Msk                 (_UINT32_(0x1) << NVM_NVMLBWP_LBWP7_Pos)             /* (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP7(value)              (NVM_NVMLBWP_LBWP7_Msk & (_UINT32_(value) << NVM_NVMLBWP_LBWP7_Pos)) /* Assigment of value for LBWP7 in the NVM_NVMLBWP register */
#define NVM_NVMLBWP_LBWP8_Pos                 _UINT32_(8)                                          /* (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP8_Msk                 (_UINT32_(0x1) << NVM_NVMLBWP_LBWP8_Pos)             /* (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP8(value)              (NVM_NVMLBWP_LBWP8_Msk & (_UINT32_(value) << NVM_NVMLBWP_LBWP8_Pos)) /* Assigment of value for LBWP8 in the NVM_NVMLBWP register */
#define NVM_NVMLBWP_LBWP9_Pos                 _UINT32_(9)                                          /* (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP9_Msk                 (_UINT32_(0x1) << NVM_NVMLBWP_LBWP9_Pos)             /* (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP9(value)              (NVM_NVMLBWP_LBWP9_Msk & (_UINT32_(value) << NVM_NVMLBWP_LBWP9_Pos)) /* Assigment of value for LBWP9 in the NVM_NVMLBWP register */
#define NVM_NVMLBWP_LBWP10_Pos                _UINT32_(10)                                         /* (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP10_Msk                (_UINT32_(0x1) << NVM_NVMLBWP_LBWP10_Pos)            /* (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP10(value)             (NVM_NVMLBWP_LBWP10_Msk & (_UINT32_(value) << NVM_NVMLBWP_LBWP10_Pos)) /* Assigment of value for LBWP10 in the NVM_NVMLBWP register */
#define NVM_NVMLBWP_LBWP11_Pos                _UINT32_(11)                                         /* (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP11_Msk                (_UINT32_(0x1) << NVM_NVMLBWP_LBWP11_Pos)            /* (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP11(value)             (NVM_NVMLBWP_LBWP11_Msk & (_UINT32_(value) << NVM_NVMLBWP_LBWP11_Pos)) /* Assigment of value for LBWP11 in the NVM_NVMLBWP register */
#define NVM_NVMLBWP_LBWP12_Pos                _UINT32_(12)                                         /* (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP12_Msk                (_UINT32_(0x1) << NVM_NVMLBWP_LBWP12_Pos)            /* (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP12(value)             (NVM_NVMLBWP_LBWP12_Msk & (_UINT32_(value) << NVM_NVMLBWP_LBWP12_Pos)) /* Assigment of value for LBWP12 in the NVM_NVMLBWP register */
#define NVM_NVMLBWP_LBWP13_Pos                _UINT32_(13)                                         /* (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP13_Msk                (_UINT32_(0x1) << NVM_NVMLBWP_LBWP13_Pos)            /* (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP13(value)             (NVM_NVMLBWP_LBWP13_Msk & (_UINT32_(value) << NVM_NVMLBWP_LBWP13_Pos)) /* Assigment of value for LBWP13 in the NVM_NVMLBWP register */
#define NVM_NVMLBWP_LBWP14_Pos                _UINT32_(14)                                         /* (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP14_Msk                (_UINT32_(0x1) << NVM_NVMLBWP_LBWP14_Pos)            /* (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP14(value)             (NVM_NVMLBWP_LBWP14_Msk & (_UINT32_(value) << NVM_NVMLBWP_LBWP14_Pos)) /* Assigment of value for LBWP14 in the NVM_NVMLBWP register */
#define NVM_NVMLBWP_LBWP15_Pos                _UINT32_(15)                                         /* (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP15_Msk                (_UINT32_(0x1) << NVM_NVMLBWP_LBWP15_Pos)            /* (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP15(value)             (NVM_NVMLBWP_LBWP15_Msk & (_UINT32_(value) << NVM_NVMLBWP_LBWP15_Pos)) /* Assigment of value for LBWP15 in the NVM_NVMLBWP register */
#define NVM_NVMLBWP_LBWP16_Pos                _UINT32_(16)                                         /* (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP16_Msk                (_UINT32_(0x1) << NVM_NVMLBWP_LBWP16_Pos)            /* (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP16(value)             (NVM_NVMLBWP_LBWP16_Msk & (_UINT32_(value) << NVM_NVMLBWP_LBWP16_Pos)) /* Assigment of value for LBWP16 in the NVM_NVMLBWP register */
#define NVM_NVMLBWP_LBWP17_Pos                _UINT32_(17)                                         /* (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP17_Msk                (_UINT32_(0x1) << NVM_NVMLBWP_LBWP17_Pos)            /* (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP17(value)             (NVM_NVMLBWP_LBWP17_Msk & (_UINT32_(value) << NVM_NVMLBWP_LBWP17_Pos)) /* Assigment of value for LBWP17 in the NVM_NVMLBWP register */
#define NVM_NVMLBWP_LBWP18_Pos                _UINT32_(18)                                         /* (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP18_Msk                (_UINT32_(0x1) << NVM_NVMLBWP_LBWP18_Pos)            /* (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP18(value)             (NVM_NVMLBWP_LBWP18_Msk & (_UINT32_(value) << NVM_NVMLBWP_LBWP18_Pos)) /* Assigment of value for LBWP18 in the NVM_NVMLBWP register */
#define NVM_NVMLBWP_LBWP19_Pos                _UINT32_(19)                                         /* (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP19_Msk                (_UINT32_(0x1) << NVM_NVMLBWP_LBWP19_Pos)            /* (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP19(value)             (NVM_NVMLBWP_LBWP19_Msk & (_UINT32_(value) << NVM_NVMLBWP_LBWP19_Pos)) /* Assigment of value for LBWP19 in the NVM_NVMLBWP register */
#define NVM_NVMLBWP_LBWP20_Pos                _UINT32_(20)                                         /* (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP20_Msk                (_UINT32_(0x1) << NVM_NVMLBWP_LBWP20_Pos)            /* (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP20(value)             (NVM_NVMLBWP_LBWP20_Msk & (_UINT32_(value) << NVM_NVMLBWP_LBWP20_Pos)) /* Assigment of value for LBWP20 in the NVM_NVMLBWP register */
#define NVM_NVMLBWP_LBWP21_Pos                _UINT32_(21)                                         /* (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP21_Msk                (_UINT32_(0x1) << NVM_NVMLBWP_LBWP21_Pos)            /* (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP21(value)             (NVM_NVMLBWP_LBWP21_Msk & (_UINT32_(value) << NVM_NVMLBWP_LBWP21_Pos)) /* Assigment of value for LBWP21 in the NVM_NVMLBWP register */
#define NVM_NVMLBWP_LBWP22_Pos                _UINT32_(22)                                         /* (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP22_Msk                (_UINT32_(0x1) << NVM_NVMLBWP_LBWP22_Pos)            /* (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP22(value)             (NVM_NVMLBWP_LBWP22_Msk & (_UINT32_(value) << NVM_NVMLBWP_LBWP22_Pos)) /* Assigment of value for LBWP22 in the NVM_NVMLBWP register */
#define NVM_NVMLBWP_LBWP23_Pos                _UINT32_(23)                                         /* (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_LBWP23_Msk                (_UINT32_(0x1) << NVM_NVMLBWP_LBWP23_Pos)            /* (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_LBWP23(value)             (NVM_NVMLBWP_LBWP23_Msk & (_UINT32_(value) << NVM_NVMLBWP_LBWP23_Pos)) /* Assigment of value for LBWP23 in the NVM_NVMLBWP register */
#define NVM_NVMLBWP_ULOCK_Pos                 _UINT32_(31)                                         /* (NVM_NVMLBWP)  Position */
#define NVM_NVMLBWP_ULOCK_Msk                 (_UINT32_(0x1) << NVM_NVMLBWP_ULOCK_Pos)             /* (NVM_NVMLBWP)  Mask */
#define NVM_NVMLBWP_ULOCK(value)              (NVM_NVMLBWP_ULOCK_Msk & (_UINT32_(value) << NVM_NVMLBWP_ULOCK_Pos)) /* Assigment of value for ULOCK in the NVM_NVMLBWP register */
#define NVM_NVMLBWP_Msk                       _UINT32_(0x80FFFFFF)                                 /* (NVM_NVMLBWP) Register Mask  */

#define NVM_NVMLBWP_LBWP_Pos                  _UINT32_(0)                                          /* (NVM_NVMLBWP Position)  */
#define NVM_NVMLBWP_LBWP_Msk                  (_UINT32_(0xFFFFFF) << NVM_NVMLBWP_LBWP_Pos)         /* (NVM_NVMLBWP Mask) LBWP */
#define NVM_NVMLBWP_LBWP(value)               (NVM_NVMLBWP_LBWP_Msk & (_UINT32_(value) << NVM_NVMLBWP_LBWP_Pos)) 

/* -------- NVM_NVMLBWPCLR : (NVM Offset: 0xF4) (R/W 32)  -------- */
#define NVM_NVMLBWPCLR_RESETVALUE             _UINT32_(0x00)                                       /*  (NVM_NVMLBWPCLR)   Reset Value */

#define NVM_NVMLBWPCLR_Msk                    _UINT32_(0x00000000)                                 /* (NVM_NVMLBWPCLR) Register Mask  */


/* -------- NVM_NVMLBWPSET : (NVM Offset: 0xF8) (R/W 32)  -------- */
#define NVM_NVMLBWPSET_RESETVALUE             _UINT32_(0x00)                                       /*  (NVM_NVMLBWPSET)   Reset Value */

#define NVM_NVMLBWPSET_Msk                    _UINT32_(0x00000000)                                 /* (NVM_NVMLBWPSET) Register Mask  */


/* -------- NVM_NVMLBWPINV : (NVM Offset: 0xFC) (R/W 32)  -------- */
#define NVM_NVMLBWPINV_RESETVALUE             _UINT32_(0x00)                                       /*  (NVM_NVMLBWPINV)   Reset Value */

